Try starting with the most simple build, then work yourself up with all the options....  Here is a bare-bones example.

main.tf
```
provider "esxi" {
  esxi_hostname = var.esxi_hostname
  esxi_username = var.esxi_username
  esxi_password = var.esxi_password
}


locals {
  guests = {
    "k3s_server_0" = { mac_address = "00:50:56:a3:b1:c2" },
    "k3s_worker_1" = { mac_address = "00:50:56:a3:b1:c3" },
    "k3s_worker_2" = { mac_address = "00:50:56:a3:b1:c4" }
  }
}


resource "esxi_guest" "vmtest01" {
  for_each   = local.guests

  guest_name = each.key
  disk_store = var.disk_store
  network_interfaces {
    virtual_network = var.vm_network
    mac_address = each.value.mac_address
  }
}
```

```
[root@q   terraform-test]# terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # esxi_guest.vmtest01["k3s_server_0"] will be created
  + resource "esxi_guest" "vmtest01" {
      + boot_disk_size         = (known after apply)
      + boot_disk_type         = "thin"
      + disk_store             = "DS_4TB"
      + guest_name             = "k3s_server_0"
      + guest_shutdown_timeout = (known after apply)
      + guest_startup_timeout  = (known after apply)
      + guestos                = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + memsize                = (known after apply)
      + notes                  = (known after apply)
      + numvcpus               = (known after apply)
      + ovf_properties_timer   = (known after apply)
      + power                  = "on"
      + resource_pool_name     = (known after apply)
      + virthwver              = (known after apply)

      + network_interfaces {
          + mac_address     = "00:50:56:a3:b1:c2"
          + nic_type        = (known after apply)
          + virtual_network = "192.168.1"
        }
    }

  # esxi_guest.vmtest01["k3s_worker_1"] will be created
  + resource "esxi_guest" "vmtest01" {
      + boot_disk_size         = (known after apply)
      + boot_disk_type         = "thin"
      + disk_store             = "DS_4TB"
      + guest_name             = "k3s_worker_1"
      + guest_shutdown_timeout = (known after apply)
      + guest_startup_timeout  = (known after apply)
      + guestos                = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + memsize                = (known after apply)
      + notes                  = (known after apply)
      + numvcpus               = (known after apply)
      + ovf_properties_timer   = (known after apply)
      + power                  = "on"
      + resource_pool_name     = (known after apply)
      + virthwver              = (known after apply)

      + network_interfaces {
          + mac_address     = "00:50:56:a3:b1:c3"
          + nic_type        = (known after apply)
          + virtual_network = "192.168.1"
        }
    }

  # esxi_guest.vmtest01["k3s_worker_2"] will be created
  + resource "esxi_guest" "vmtest01" {
      + boot_disk_size         = (known after apply)
      + boot_disk_type         = "thin"
      + disk_store             = "DS_4TB"
      + guest_name             = "k3s_worker_2"
      + guest_shutdown_timeout = (known after apply)
      + guest_startup_timeout  = (known after apply)
      + guestos                = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + memsize                = (known after apply)
      + notes                  = (known after apply)
      + numvcpus               = (known after apply)
      + ovf_properties_timer   = (known after apply)
      + power                  = "on"
      + resource_pool_name     = (known after apply)
      + virthwver              = (known after apply)

      + network_interfaces {
          + mac_address     = "00:50:56:a3:b1:c4"
          + nic_type        = (known after apply)
          + virtual_network = "192.168.1"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

esxi_guest.vmtest01["k3s_worker_1"]: Creating...
esxi_guest.vmtest01["k3s_worker_2"]: Creating...
esxi_guest.vmtest01["k3s_server_0"]: Creating...
esxi_guest.vmtest01["k3s_worker_1"]: Still creating... [10s elapsed]
esxi_guest.vmtest01["k3s_worker_2"]: Still creating... [10s elapsed]
esxi_guest.vmtest01["k3s_server_0"]: Still creating... [10s elapsed]
esxi_guest.vmtest01["k3s_worker_1"]: Still creating... [20s elapsed]
esxi_guest.vmtest01["k3s_worker_2"]: Still creating... [20s elapsed]
esxi_guest.vmtest01["k3s_server_0"]: Still creating... [20s elapsed]
esxi_guest.vmtest01["k3s_worker_1"]: Still creating... [30s elapsed]
esxi_guest.vmtest01["k3s_worker_2"]: Still creating... [30s elapsed]
esxi_guest.vmtest01["k3s_server_0"]: Still creating... [30s elapsed]
esxi_guest.vmtest01["k3s_worker_1"]: Still creating... [40s elapsed]
esxi_guest.vmtest01["k3s_worker_2"]: Still creating... [40s elapsed]
esxi_guest.vmtest01["k3s_server_0"]: Still creating... [40s elapsed]
esxi_guest.vmtest01["k3s_worker_1"]: Still creating... [50s elapsed]
esxi_guest.vmtest01["k3s_worker_2"]: Still creating... [50s elapsed]
esxi_guest.vmtest01["k3s_server_0"]: Still creating... [50s elapsed]
esxi_guest.vmtest01["k3s_worker_1"]: Still creating... [1m0s elapsed]
esxi_guest.vmtest01["k3s_worker_2"]: Still creating... [1m0s elapsed]
esxi_guest.vmtest01["k3s_server_0"]: Still creating... [1m0s elapsed]
esxi_guest.vmtest01["k3s_worker_1"]: Still creating... [1m10s elapsed]
esxi_guest.vmtest01["k3s_worker_2"]: Still creating... [1m10s elapsed]
esxi_guest.vmtest01["k3s_server_0"]: Still creating... [1m10s elapsed]
esxi_guest.vmtest01["k3s_worker_1"]: Still creating... [1m20s elapsed]
esxi_guest.vmtest01["k3s_worker_2"]: Still creating... [1m20s elapsed]
esxi_guest.vmtest01["k3s_server_0"]: Still creating... [1m20s elapsed]
esxi_guest.vmtest01["k3s_worker_1"]: Still creating... [1m30s elapsed]
esxi_guest.vmtest01["k3s_worker_2"]: Still creating... [1m30s elapsed]
esxi_guest.vmtest01["k3s_server_0"]: Still creating... [1m30s elapsed]
esxi_guest.vmtest01["k3s_worker_1"]: Still creating... [1m40s elapsed]
esxi_guest.vmtest01["k3s_worker_2"]: Still creating... [1m40s elapsed]
esxi_guest.vmtest01["k3s_server_0"]: Still creating... [1m40s elapsed]
esxi_guest.vmtest01["k3s_worker_1"]: Still creating... [1m50s elapsed]
esxi_guest.vmtest01["k3s_worker_2"]: Still creating... [1m50s elapsed]
esxi_guest.vmtest01["k3s_server_0"]: Still creating... [1m50s elapsed]
esxi_guest.vmtest01["k3s_worker_1"]: Still creating... [2m0s elapsed]
esxi_guest.vmtest01["k3s_worker_2"]: Still creating... [2m0s elapsed]
esxi_guest.vmtest01["k3s_server_0"]: Still creating... [2m0s elapsed]
esxi_guest.vmtest01["k3s_worker_1"]: Still creating... [2m10s elapsed]
esxi_guest.vmtest01["k3s_worker_2"]: Still creating... [2m10s elapsed]
esxi_guest.vmtest01["k3s_server_0"]: Still creating... [2m10s elapsed]
esxi_guest.vmtest01["k3s_worker_1"]: Still creating... [2m20s elapsed]
esxi_guest.vmtest01["k3s_worker_2"]: Still creating... [2m20s elapsed]
esxi_guest.vmtest01["k3s_server_0"]: Still creating... [2m20s elapsed]
esxi_guest.vmtest01["k3s_worker_1"]: Creation complete after 2m25s [id=20]
esxi_guest.vmtest01["k3s_worker_2"]: Creation complete after 2m26s [id=19]
esxi_guest.vmtest01["k3s_server_0"]: Creation complete after 2m26s [id=21]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

```
[root@q   terraform-test]# terraform show
# esxi_guest.vmtest01["k3s_server_0"]:
resource "esxi_guest" "vmtest01" {
    boot_disk_type         = "thin"
    disk_store             = "DS_4TB"
    guest_name             = "k3s_server_0"
    guest_shutdown_timeout = 20
    guest_startup_timeout  = 120
    guestos                = "centos-64"
    id                     = "21"
    memsize                = "512"
    numvcpus               = "1"
    ovf_properties_timer   = 0
    power                  = "on"
    resource_pool_name     = "/"
    virthwver              = "8"

    network_interfaces {
        mac_address     = "00:50:56:a3:b1:c2"
        nic_type        = "e1000"
        virtual_network = "192.168.1"
    }
}

# esxi_guest.vmtest01["k3s_worker_1"]:
resource "esxi_guest" "vmtest01" {
    boot_disk_type         = "thin"
    disk_store             = "DS_4TB"
    guest_name             = "k3s_worker_1"
    guest_shutdown_timeout = 20
    guest_startup_timeout  = 120
    guestos                = "centos-64"
    id                     = "20"
    memsize                = "512"
    numvcpus               = "1"
    ovf_properties_timer   = 0
    power                  = "on"
    resource_pool_name     = "/"
    virthwver              = "8"

    network_interfaces {
        mac_address     = "00:50:56:a3:b1:c3"
        nic_type        = "e1000"
        virtual_network = "192.168.1"
    }
}

# esxi_guest.vmtest01["k3s_worker_2"]:
resource "esxi_guest" "vmtest01" {
    boot_disk_type         = "thin"
    disk_store             = "DS_4TB"
    guest_name             = "k3s_worker_2"
    guest_shutdown_timeout = 20
    guest_startup_timeout  = 120
    guestos                = "centos-64"
    id                     = "19"
    memsize                = "512"
    numvcpus               = "1"
    ovf_properties_timer   = 0
    power                  = "on"
    resource_pool_name     = "/"
    virthwver              = "8"

    network_interfaces {
        mac_address     = "00:50:56:a3:b1:c4"
        nic_type        = "e1000"
        virtual_network = "192.168.1"
    }
}
```